In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([[4,7],[36,1],[45,4]], columns=['id_pedido', 'quantidade'])
df2 = pd.DataFrame([[90,12],[24,1],[47,4]], columns=['id_pedido', 'quantidade'])

In [9]:
df1

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4

In [10]:
df2

   id_pedido  quantidade
0         90          12
1         24           1
2         47           4

In [11]:
# concat
pd.concat([df1,df2])

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
0         90          12
1         24           1
2         47           4

In [12]:
pd.concat([df1,df2], ignore_index=True)

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
3         90          12
4         24           1
5         47           4

In [14]:
pd.concat([df1,df2], axis=1)

   id_pedido  quantidade  id_pedido  quantidade
0          4           7         90          12
1         36           1         24           1
2         45           4         47           4

In [15]:
df_roupas = pd.DataFrame([[1,5],[2,15],[3,25]], columns=['id_vendedor', 'vendas_roupas'])
df_calcados = pd.DataFrame([[1,30],[2,10],[4,80]], columns=['id_vendedor', 'vendas_calcados'])

In [16]:
df_roupas

   id_vendedor  vendas_roupas
0            1              5
1            2             15
2            3             25

In [17]:
df_calcados

   id_vendedor  vendas_calcados
0            1               30
1            2               10
2            4               80

In [19]:
pd.merge(df_roupas, df_calcados, on='id_vendedor')

   id_vendedor  vendas_roupas  vendas_calcados
0            1              5               30
1            2             15               10

In [20]:
pd.merge(df_roupas, df_calcados, on='id_vendedor', how='left')

   id_vendedor  vendas_roupas  vendas_calcados
0            1              5             30.0
1            2             15             10.0
2            3             25              NaN

In [21]:
pd.merge(df_roupas, df_calcados, on='id_vendedor', how='outer')

   id_vendedor  vendas_roupas  vendas_calcados
0            1            5.0             30.0
1            2           15.0             10.0
2            3           25.0              NaN
3            4            NaN             80.0

In [22]:
#append

In [23]:
df1

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4

In [24]:
df2

   id_pedido  quantidade
0         90          12
1         24           1
2         47           4

In [27]:
df_total = df1.append(df2)

In [28]:
df_total

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
0         90          12
1         24           1
2         47           4